Core/src/InformationRegisters/ОчередьПолученияДанныхГИСМ/ОчередьПолученияДанныхГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьПолученияДанныхГИСМ</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>action_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>GLN</name>
    <type>
      <types>DefinedType.GLN</types>
    </type>
  </dimensions>
  <dimensions>
    <name>output_id</name>
    <type>
      <types>DefinedType.НомерДокументаГИСМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ОчередьПолученияДанныхГИСМ/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Данные
		|ИЗ
		|	РегистрСведений.ОчередьПолученияДанныхГИСМ КАК Т
		|ГДЕ
		|	Т.GLN = &GLN
		|	И Т.output_id = &output_id");
		
		Запрос.УстановитьПараметр("GLN", Запись.GLN);
		Запрос.УстановитьПараметр("output_id", Запись.output_id);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Сообщения = Выборка.Данные.Получить();
			
			Если Сообщения <> Неопределено Тогда
				
				ТекстовыйДокументКонвертSOAP.УстановитьТекст(Сообщения.ТекстВходящегоСообщенияXML);
				
				ТекстСообщенияXML = ИнтеграцияГИСМВызовСервера.ТекстВходящегоСообщенияXML(Сообщения.ТекстВходящегоСообщенияXML);
				ТекстСообщенияXML = ИнтеграцияГИСМВызовСервера.ФорматироватьXMLСПараметрами(ТекстСообщенияXML, ИнтеграцияГИСМ.ПараметрыФорматированияXML(Истина, "  "));
				
				ТекстовыйДокументТекстСообщенияXML.УстановитьТекст(ТекстСообщенияXML);
				
			Иначе
				
				ТекстовыйДокументКонвертSOAP.УстановитьТекст(НСтр("ka='<SOAP-конверт не загружен>';ru='<SOAP-конверт не загружен>';en='<SOAP-envelope is loaded>'"));
				ТекстовыйДокументТекстСообщенияXML.УстановитьТекст(НСтр("ka='<SOAP-конверт не загружен>';ru='<SOAP-конверт не загружен>';en='<SOAP-envelope is loaded>'"));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПодготовитьКПовторнойЗагрузке Тогда
		ТекущийОбъект.Данные = Новый ХранилищеЗначения(Неопределено);
		ПодготовитьКПовторнойЗагрузке = Ложь;
		ТекстовыйДокументКонвертSOAP.УстановитьТекст(НСтр("ka='<SOAP-конверт не загружен>';ru='<SOAP-конверт не загружен>';en='<SOAP-envelope is loaded>'"));
		ТекстовыйДокументТекстСообщенияXML.УстановитьТекст(НСтр("ka='<SOAP-конверт не загружен>';ru='<SOAP-конверт не загружен>';en='<SOAP-envelope is loaded>'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодготовитьКПовторнойЗагрузке(Команда)
	
	ПодготовитьКПовторнойЗагрузке = Истина;
	Записать();
	
КонецПроцедуры

#КонецОбласти
